Documents/РасчетНДФЛПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасчетНДФЛПайщиков</Name>
			<BasedOn>
				<xr:Item>Document.РаспределениеДоходаПайщикам</xr:Item>
				<xr:Item>Document.Оплата</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияНалогов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.БазаНачисленияНДФЛ</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НалоговаяБаза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пайщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаевойИнвестиционныйФонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РаспределениеДоходаПайщикам</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалогооблагаемойБазы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНалогооблагаемыхБаз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВычета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВычета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДФЛ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходСНачалаГода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВычетСНачалаГода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИнвестиционногоВычета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИнвестВычета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДФЛПовышенная</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалогаСПревышения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестВычетСНачалаГода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименятьИнвестВычетПоЗаявлению</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентВладенияЦБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/НачисленияНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>НачисленияНалогов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазаНалога</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтавкиНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка09</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка15</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка30</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка35</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПифовВЗависимостиОтЛиквидности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыПифовВЗависимостиОтЛиквидности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открытый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрытый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервальный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Биржевой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасчетНДФЛПайщиков/Ext/ObjectModule.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда 
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РаспределениеДоходаПайщикам") Тогда 
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация");
			ЭтотОбъект.Дата  = НачалоДня(ДанныеЗаполнения.Дата) + 5*60;
			
			ЗаполнитьТабличнуюЧасть();
			
		КонецЕсли;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокумента

Функция ДобавитьПроводку(НаборДвижений, СчетДоверительногоУправления, Сумма, Содержание)
	
		Проводка = НаборДвижений.Добавить();
	
		Проводка.Период                       = Этотобъект.Дата;
		Проводка.Организация                  = Этотобъект.Организация;
		Проводка.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления);
		Проводка.Сумма                        = Сумма;
		Проводка.Содержание                   = Содержание;
	

		Возврат Проводка;
		
КонецФункции 

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетНДФЛПайщиковНалоговаяБаза.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	РасчетНДФЛПайщиковНалоговаяБаза.Пайщик КАК Пайщик,
	|	РасчетНДФЛПайщиковНалоговаяБаза.Основание КАК Основание,
	|	РасчетНДФЛПайщиковНалоговаяБаза.СтавкаНДФЛ КАК СтавкаНДФЛ,
	|	РасчетНДФЛПайщиковНалоговаяБаза.СуммаНалога КАК СуммаНалога,
	|	РасчетНДФЛПайщиковНалоговаяБаза.СтавкаНДФЛПовышенная КАК СтавкаНДФЛПовышенная,
	|	РасчетНДФЛПайщиковНалоговаяБаза.СуммаНалогаСПревышения КАК СуммаНалогаСПревышения,
	|	ЕСТЬNULL(ПартииПогашенияПаев.СуммаПогашения, 0) КАК СуммаПогашения,
	|	ЕСТЬNULL(ПартииПогашенияПаев.СуммаСкидки, 0) КАК СуммаСкидки
	|ИЗ
	|	Документ.РасчетНДФЛПайщиков.НалоговаяБаза КАК РасчетНДФЛПайщиковНалоговаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПогашениеПаевПартии.Ссылка.Заявка КАК Заявка,
	|			ПогашениеПаевПартии.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|			ПогашениеПаевПартии.Ссылка.Пайщик КАК Пайщик,
	|			СУММА(ПогашениеПаевПартии.СуммаПогашения) КАК СуммаПогашения,
	|			СУММА(ПогашениеПаевПартии.СуммаСкидки) КАК СуммаСкидки
	|		ИЗ
	|			Документ.ПогашениеПаев.Партии КАК ПогашениеПаевПартии
	|		ГДЕ
	|			ПогашениеПаевПартии.Ссылка.Заявка В(&ЗаявкиПайщиков)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПогашениеПаевПартии.Ссылка,
	|			ПогашениеПаевПартии.Ссылка.Заявка,
	|			ПогашениеПаевПартии.Ссылка.Пайщик,
	|			ПогашениеПаевПартии.Ссылка.СчетДоверительногоУправления) КАК ПартииПогашенияПаев
	|		ПО РасчетНДФЛПайщиковНалоговаяБаза.Основание = ПартииПогашенияПаев.Заявка
	|			И РасчетНДФЛПайщиковНалоговаяБаза.СчетДоверительногоУправления = ПартииПогашенияПаев.СчетДоверительногоУправления
	|			И РасчетНДФЛПайщиковНалоговаяБаза.Пайщик = ПартииПогашенияПаев.Пайщик
	|ГДЕ
	|	РасчетНДФЛПайщиковНалоговаяБаза.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетДоверительногоУправления
	|ИТОГИ ПО
	|	СчетДоверительногоУправления"; 
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ЗаявкиПайщиков", ЭтотОбъект.НалоговаяБаза.ВыгрузитьКолонку("Основание")); 
	
	ВыборкаСчетДУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
	
	Пока ВыборкаСчетДУ.Следующий() Цикл                                 
		
		НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ВыборкаСчетДУ.СчетДоверительногоУправления); 
		
		Выборка = ВыборкаСчетДУ.Выбрать(ОбходРезультатаЗапроса.Прямой); 
		Пока Выборка.Следующий() Цикл  
			
			СуммаПроводки = Выборка.СуммаНалога + Выборка.СуммаНалогаСПревышения;
			
			// нельзя использовать функцию РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(). Счет ДУ берем из табличной части. 
			Проводка = ДобавитьПроводку(Движения[УчетныйРегистр], Выборка.СчетДоверительногоУправления, СуммаПроводки, "Начислен НДФЛ");
			
			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			Проводка.СубконтоДт.Контрагенты = Выборка.Пайщик;
			
			Проводка.СчетКт = ПланыСчетов.Основной.НДФЛ;
			Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;  
			
			Если НастройкиУчета.ВестиУчетИмуществаПайщиков Тогда
				
				// в учете пайщика есть субконто Ставка НДФЛ, если надо, делаем две проводки
				Для НомерЦикла = 1 по 2 Цикл 
					Если НомерЦикла = 1 И Выборка.СуммаНалога > 0 Тогда
						СуммаПроводки = Выборка.СуммаНалога;
						СтавкаНДФЛ = Выборка.СтавкаНДФЛ;
					ИначеЕсли НомерЦикла = 2 И Выборка.СуммаНалогаСПревышения > 0 Тогда 
						СуммаПроводки = Выборка.СуммаНалогаСПревышения;
						СтавкаНДФЛ = Выборка.СтавкаНДФЛПовышенная;
					Иначе
						Продолжить;
					КонецЕсли;
					
					// П99 - П68.1
					Проводка = ДобавитьПроводку(Движения[УчетныйРегистр], Выборка.СчетДоверительногоУправления, СуммаПроводки, "Начислен НДФЛ к уплате");
					
					Проводка.СчетДт = ПланыСчетов.Основной.ПрибылиИУбыткиПайщика;
					Проводка.СубконтоДт.Пайщики = Выборка.Пайщик;
					
					Проводка.СчетКт = ПланыСчетов.Основной.НДФЛНачислен;
					Проводка.СубконтоКт.Пайщики = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;  
					Проводка.СубконтоКт.СтавкиНДФЛ = СтавкаНДФЛ;  
					
					//П68.1 - П76.1  
					Проводка = ДобавитьПроводку(Движения[УчетныйРегистр], Выборка.СчетДоверительногоУправления, СуммаПроводки, "Начислен НДФЛ к уплате");
					
					Проводка.СчетДт = ПланыСчетов.Основной.НДФЛНачислен;
					Проводка.СубконтоДт.Пайщики = Выборка.Пайщик;
					Проводка.СубконтоДт.СтавкиНДФЛ = СтавкаНДФЛ;  
					
					Проводка.СчетКт = ПланыСчетов.Основной.РасчетыКлиентаСПИФ;
					Проводка.СубконтоКт.Пайщики = Выборка.Пайщик;  
					Проводка.СубконтоКт.ЗаявкиПайщиков = Выборка.Основание;  // для Распределния расхода заявки не будет. 
					
				КонецЦикла;
				
				// П51 - П76.1  - сумма погашение - сумма НДФЛ - сумма скидки 
				
				СуммаПроводки = Выборка.СуммаПогашения - Выборка.СуммаСкидки - Выборка.СуммаНалога - Выборка.СуммаНалогаСПревышения;
				
				Проводка = ДобавитьПроводку(Движения[УчетныйРегистр], Выборка.СчетДоверительногоУправления, СуммаПроводки, "Получено пайщиком");
				
				Проводка.СчетДт = ПланыСчетов.Основной.СредстваКлиента;
				Проводка.СубконтоДт.Пайщики = Выборка.Пайщик;
				
				Проводка.СчетКт = ПланыСчетов.Основной.РасчетыКлиентаСПИФ; 
				Проводка.СубконтоКт.Пайщики = Выборка.Пайщик;  
				Проводка.СубконтоКт.ЗаявкиПайщиков = Выборка.Основание;  // для Распределния расхода заявки не будет. 
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	
КонецПроцедуры

Процедура ЗаполнитьДвижениеБазаНачисленияНДФЛ(Пайщик, Сумма, ВидНалогооблагаемойБазы, КодДоходаВычета, СтавкаНДФЛ)

	Движение = Движения.БазаНачисленияНДФЛ.Добавить();
	Движение.Период = ЭтотОбъект.Дата;
	Движение.Организация = ЭтотОбъект.Организация;
	Движение.ФизЛицо = Пайщик;                 
	Если ЗначениеЗаполнено(ВидНалогооблагаемойБазы) Тогда
		Движение.ВидНалогооблагаемойБазы = ВидНалогооблагаемойБазы;
	Иначе    
		Если КодДоходаВычета = Справочники.ВидыДоходовНДФЛ.Код1530 ИЛИ КодДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код201 ИЛИ КодДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код618 Тогда 
			Движение.ВидНалогооблагаемойБазы = Перечисления.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым;
		Иначе 
			Движение.ВидНалогооблагаемойБазы = Перечисления.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамНеобращаемым;
		КонецЕсли;
	КонецЕсли;
	Движение.ДатаПолученияДохода = НачалоМесяца(ЭтотОбъект.Дата);
	Движение.ВидДоходаВычета = КодДоходаВычета;
	Движение.СтавкаНДФЛ = СтавкаНДФЛ; 
	Движение.СуммаНДФЛ = Сумма; 
	Если КодДоходаВычета = Справочники.ВидыВычетовНДФЛ.Код618 Тогда 
		Движение.Сумма = 0; // затрат нет. 
	Иначе
		Движение.Сумма = Сумма;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДвижениеНачисленияНалогов(СчетДоверительногоУправления, Пайщик, СтавкаНДФЛ, БазаНалога, СуммаНалога)
	
	Движение = Движения.НачисленияНалогов.Добавить();
	Движение.Период = ЭтотОбъект.Дата;
	Движение.Организация = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = СчетДоверительногоУправления;
	Движение.Налогоплательщик = Пайщик; 
	Если СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка13 Тогда 
		Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ13;
	ИначеЕсли СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка15 Тогда 
		Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ15;
	КонецЕсли;
	Движение.Основание = ЭтотОбъект.Ссылка;
	Движение.БазаНалога = БазаНалога;
	Движение.Сумма = СуммаНалога;

КонецПроцедуры

Процедура ЗаполнитьДвижениеЗадолженностиПоДенежнымСредствам(ВидДвижения, СчетДоверительногоУправления, Контрагент, Основание, ВидЗадолженности, Сумма, Валюта)
	
	Движение = Движения.ЗадолженностиПоДенежнымСредствам.Добавить();  
	
	Движение.ВидДвижения = ВидДвижения;
	Движение.Период = ЭтотОбъект.Дата; 
	Движение.Основание = Основание;     
	Движение.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская; 
	Движение.ВидЗадолженности = ВидЗадолженности;
	Движение.Организация = ЭтотОбъект.Организация; 
	Движение.СчетДоверительногоУправления = СчетДоверительногоУправления;
	Движение.Валюта = Валюта;
	Движение.Контрагент = Контрагент;
	Движение.Аванс = Ложь; 
	Движение.Сумма = Сумма;
	Движение.СуммаКупона = 0;
	
КонецПРоцедуры 

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт 
	
	ПороговаяСумма = РаботаСНалогамиКлиентСервер.ПорогПримененияСтавкиНДФЛ15Процентов(ЭтотОбъект.Дата, Перечисления.СтавкиНДФЛ.Ставка13);  
	//СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ЭтотОбъект.ПаевойИнвестиционныйФонд, ЭтотОбъект.Дата);

	// регистр БазаНачисленияНДФЛ 
	Движения.БазаНачисленияНДФЛ.Записывать = Истина; 
	Движения.НачисленияНалогов.Записывать = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина; 
    ВалютаРубль = ЭтотОбъект.Организация.ВалютаУчета;  
	КонтрагентИФНС = РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, Ложь);
	
	Для Каждого ТекСтрокаНалоговаяБаза Из НалоговаяБаза Цикл  
		
		Если  ТекСтрокаНалоговаяБаза.СуммаНалога >= 0 И ТекСтрокаНалоговаяБаза.СуммаНалогаСПревышения = 0 Тогда
			//вся сумма идет по ставке 13
			
			Если ТекСтрокаНалоговаяБаза.СуммаДохода > 0 Тогда   // доход, надеюсь, будет всегда. Иначе зачем делать расчет?
				ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, ТекСтрокаНалоговаяБаза.СуммаДохода, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидДохода, ТекСтрокаНалоговаяБаза.СтавкаНДФЛ);
			КонецЕсли;
			
			Если ТекСтрокаНалоговаяБаза.СуммаВычета > 0 Тогда 
				ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, -ТекСтрокаНалоговаяБаза.СуммаВычета, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидВычета, ТекСтрокаНалоговаяБаза.СтавкаНДФЛ);
			КонецЕсли;
			
			Если ТекСтрокаНалоговаяБаза.СуммаИнвестВычета > 0 И ТекСтрокаНалоговаяБаза.ПрименятьИнвестВычетПоЗаявлению Тогда
				ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, -ТекСтрокаНалоговаяБаза.СуммаИнвестВычета, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидИнвестиционногоВычета, ТекСтрокаНалоговаяБаза.СтавкаНДФЛ);
			КонецЕсли;
			
			БазаНалога = ТекСтрокаНалоговаяБаза.СуммаДохода - ТекСтрокаНалоговаяБаза.СуммаВычета - ?(ТекСтрокаНалоговаяБаза.ПрименятьИнвестВычетПоЗаявлению, ТекСтрокаНалоговаяБаза.СуммаИнвестВычета, 0);
			ЗаполнитьДвижениеНачисленияНалогов(ТекСтрокаНалоговаяБаза.СчетДоверительногоУправления, ТекСтрокаНалоговаяБаза.Пайщик, ТекСтрокаНалоговаяБаза.СтавкаНДФЛ, БазаНалога, ТекСтрокаНалоговаяБаза.СуммаНалога);     
			
					
		ИначеЕсли  ТекСтрокаНалоговаяБаза.СуммаНалога = 0 И ТекСтрокаНалоговаяБаза.СуммаНалогаСПревышения > 0 Тогда
			//Весь доход помещаем в 15%

			Если ТекСтрокаНалоговаяБаза.СуммаДохода > 0 Тогда
				ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, ТекСтрокаНалоговаяБаза.СуммаДохода, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидДохода, ТекСтрокаНалоговаяБаза.СтавкаНДФЛПовышенная);
			КонецЕсли;
			      
			Если ТекСтрокаНалоговаяБаза.СуммаВычета > 0 Тогда
				ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, -ТекСтрокаНалоговаяБаза.СуммаВычета, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидВычета, ТекСтрокаНалоговаяБаза.СтавкаНДФЛПовышенная);
			КонецЕсли;
			
			Если ТекСтрокаНалоговаяБаза.СуммаИнвестВычета > 0 И ТекСтрокаНалоговаяБаза.ПрименятьИнвестВычетПоЗаявлению  Тогда
				 ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, -ТекСтрокаНалоговаяБаза.СуммаИнвестВычета, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидИнвестиционногоВычета, ТекСтрокаНалоговаяБаза.СтавкаНДФЛПовышенная);
			КонецЕсли;  
			 
			БазаНалога = ТекСтрокаНалоговаяБаза.СуммаДохода - ТекСтрокаНалоговаяБаза.СуммаВычета - ?(ТекСтрокаНалоговаяБаза.ПрименятьИнвестВычетПоЗаявлению, ТекСтрокаНалоговаяБаза.СуммаИнвестВычета, 0);
			ЗаполнитьДвижениеНачисленияНалогов(ТекСтрокаНалоговаяБаза.СчетДоверительногоУправления, ТекСтрокаНалоговаяБаза.Пайщик, ТекСтрокаНалоговаяБаза.СтавкаНДФЛПовышенная, БазаНалога, ТекСтрокаНалоговаяБаза.СуммаНалогаСПревышения);
			
		ИначеЕсли  ТекСтрокаНалоговаяБаза.СуммаНалога > 0 И ТекСтрокаНалоговаяБаза.СуммаНалогаСПревышения > 0 Тогда 
			
			//Как-то надо поделить. Все что можно на 13, излишек дохода - 15%
			
			СуммаДохода15 = ТекСтрокаНалоговаяБаза.СуммаДохода - ТекСтрокаНалоговаяБаза.СуммаВычета - 
				?(ТекСтрокаНалоговаяБаза.ПрименятьИнвестВычетПоЗаявлению, ТекСтрокаНалоговаяБаза.СуммаИнвестВычета, 0) 
				+ ТекСтрокаНалоговаяБаза.ДоходСНачалаГода - ТекСтрокаНалоговаяБаза.ВычетСНачалаГода - ПороговаяСумма;
				
			СуммаДохода13 = ТекСтрокаНалоговаяБаза.СуммаДохода -  СуммаДохода15;
			
			Если СуммаДохода13 > 0 Тогда
				ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, СуммаДохода13, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидДохода, ТекСтрокаНалоговаяБаза.СтавкаНДФЛ);
			КонецЕсли;
			
			Если ТекСтрокаНалоговаяБаза.СуммаВычета > 0 Тогда
				ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, -ТекСтрокаНалоговаяБаза.СуммаВычета, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидВычета, ТекСтрокаНалоговаяБаза.СтавкаНДФЛ);
			КонецЕсли;
			
			Если ТекСтрокаНалоговаяБаза.СуммаИнвестВычета > 0 И ТекСтрокаНалоговаяБаза.ПрименятьИнвестВычетПоЗаявлению Тогда
				 ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, -ТекСтрокаНалоговаяБаза.СуммаИнвестВычета, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидИнвестиционногоВычета, ТекСтрокаНалоговаяБаза.СтавкаНДФЛ);
			КонецЕсли;
			
			Если СуммаДохода15 > 0 Тогда
				ЗаполнитьДвижениеБазаНачисленияНДФЛ(ТекСтрокаНалоговаяБаза.Пайщик, СуммаДохода15, ТекСтрокаНалоговаяБаза.ВидНалогооблагаемойБазы, ТекСтрокаНалоговаяБаза.ВидДохода, ТекСтрокаНалоговаяБаза.СтавкаНДФЛПовышенная);
			КонецЕсли;
			
			БазаНалога = СуммаДохода13 - ТекСтрокаНалоговаяБаза.СуммаВычета - ?(ТекСтрокаНалоговаяБаза.ПрименятьИнвестВычетПоЗаявлению, ТекСтрокаНалоговаяБаза.СуммаИнвестВычета, 0);
			ЗаполнитьДвижениеНачисленияНалогов(ТекСтрокаНалоговаяБаза.СчетДоверительногоУправления, ТекСтрокаНалоговаяБаза.Пайщик, ТекСтрокаНалоговаяБаза.СтавкаНДФЛ, БазаНалога, ТекСтрокаНалоговаяБаза.СуммаНалога);

			ЗаполнитьДвижениеНачисленияНалогов(ТекСтрокаНалоговаяБаза.СчетДоверительногоУправления, ТекСтрокаНалоговаяБаза.Пайщик, ТекСтрокаНалоговаяБаза.СтавкаНДФЛПовышенная, СуммаДохода15, ТекСтрокаНалоговаяБаза.СуммаНалогаСПревышения);
			
		КонецЕсли;
		
		// списшем задолженность перед пайщиками на сумму НДФЛ 
		Если  ТипЗнч(ТекСтрокаНалоговаяБаза.Основание) = Тип("ДокументСсылка.РаспределениеДоходаПайщикам") Тогда 
			ВидЗадолженности = Справочники.ВидыЗадолженности.РасчетыСПайщикамиПоВыплатеДоходаПоИнвестиционнымПаям;
		Иначе  //вывод ДС
			ВидЗадолженности = Справочники.ВидыЗадолженности.ПередПайщиками;	
		КонецЕсли;
		
		// Отключил для отладки
		Если (ТекСтрокаНалоговаяБаза.СуммаНалога + ТекСтрокаНалоговаяБаза.СуммаНалогаСПревышения > 0) Тогда 
			ЗаполнитьДвижениеЗадолженностиПоДенежнымСредствам(ВидДвиженияНакопления.Расход, 
			ТекСтрокаНалоговаяБаза.СчетДоверительногоУправления, 
			ТекСтрокаНалоговаяБаза.Пайщик, 
			ТекСтрокаНалоговаяБаза.Основание, 
			ВидЗадолженности, 
			ТекСтрокаНалоговаяБаза.СуммаНалога + ТекСтрокаНалоговаяБаза.СуммаНалогаСПревышения, 
			ВалютаРубль); 
			
			// создадим задолженность по НДФЛ. Делить 13%-15% не будем. оплата пойдет одной суммой.
			
			ЗаполнитьДвижениеЗадолженностиПоДенежнымСредствам(ВидДвиженияНакопления.Приход, 
			ТекСтрокаНалоговаяБаза.СчетДоверительногоУправления,
			КонтрагентИФНС, 
			ЭтотОбъект.Ссылка,
			Справочники.ВидыЗадолженности.ПоНДФЛ13,
			ТекСтрокаНалоговаяБаза.СуммаНалога + ТекСтрокаНалоговаяБаза.СуммаНалогаСПревышения, 
			ВалютаРубль);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);  
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти  

#Область ЗаполнениеДокумента 

Процедура РасчетСуммыНалогаПоСтроке(СтрокаНалоговойБазы, ПороговаяСумма) 

	НОБ_поДокументу = СтрокаНалоговойБазы.СуммаДохода - СтрокаНалоговойБазы.СуммаВычета - ?(СтрокаНалоговойБазы.ПрименятьИнвестВычетПоЗаявлению, СтрокаНалоговойБазы.СуммаИнвестВычета, 0);
	НОБ_сНачалаГода = СтрокаНалоговойБазы.ДоходСНачалаГода - СтрокаНалоговойБазы.ВычетСНачалаГода - СтрокаНалоговойБазы.ИнвестВычетСНачалаГода;
	
	Если НОБ_сНачалаГода < 0 Тогда 
		СуммаНалогаСНачалаГода13 = 0;
		СуммаНалогаСНачалаГода15 = 0;
	ИначеЕсли НОБ_сНачалаГода <= ПороговаяСумма ИЛИ ПороговаяСумма = 0 Тогда 
		СуммаНалогаСНачалаГода13 = Окр(НОБ_сНачалаГода * 0.13, 0);
		СуммаНалогаСНачалаГода15 = 0;  // 
	Иначе
		СуммаНалогаСНачалаГода13 = ПороговаяСумма * 0.13;
		СуммаНалогаСНачалаГода15 = Окр((НОБ_сНачалаГода - ПороговаяСумма) * 0.15, 0) ; 
	КонецЕсли; 
	
	НОБ = НОБ_сНачалаГода + НОБ_поДокументу;
	Если НОБ <= 0 Тогда 
		СтрокаНалоговойБазы.СуммаНалога = 0;
		СтрокаНалоговойБазы.СуммаНалогаСПревышения = 0;
	ИначеЕсли НОБ_поДокументу < 0 Тогда
		// Если по конткретному погашению получили убыток. 
		// По идее должен быть возврат налога. 
		// ситуация требует уточнения.                 
		// не понятно как будет в случае нескольких ПИФ. По одному убыток, по другому доход. 
		СтрокаНалоговойБазы.СуммаНалога = 0;
		СтрокаНалоговойБазы.СуммаНалогаСПревышения = 0;
	Иначе
		Если НОБ <= ПороговаяСумма ИЛИ ПороговаяСумма = 0 Тогда
			СтрокаНалоговойБазы.СуммаНалога = Окр(НОБ * 0.13, 0) - СуммаНалогаСНачалаГода13; 
			СтрокаНалоговойБазы.СуммаНалогаСПревышения = 0;
		Иначе
			Если НОБ_сНачалаГода > ПороговаяСумма Тогда
				СтрокаНалоговойБазы.СуммаНалога = 0;
				СтрокаНалоговойБазы.СуммаНалогаСПревышения = Окр((НОБ - ПороговаяСумма) * 0.15, 0) - СуммаНалогаСНачалаГода15;
			Иначе
				//делим 13/15 
				СтрокаНалоговойБазы.СуммаНалога = ПороговаяСумма * 0.13 - СуммаНалогаСНачалаГода13; 
				СтрокаНалоговойБазы.СуммаНалогаСПревышения = Окр((НОБ - ПороговаяСумма) * 0.15, 0) - СуммаНалогаСНачалаГода15; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;   	
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть() Экспорт 
	
	Запрос = Новый Запрос;     
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ОграничениеСуммыИнвестВычета", 3000000);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ПОМЕСТИТЬ _СчетаДУ
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И ТИПЗНАЧЕНИЯ(Клиент) = ТИП(Справочник.ПаевыеИнвестиционныеФонды)) КАК КлиентыДоверительногоУправленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаевыеИнвестиционныеФонды.Ссылка КАК ПаевойИнвестиционныйФонд,
	|	_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ВЫБОР
	|		КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
	|				И РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамОбращаемым)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоЦеннымБумагамНеобращаемым)
	|	КОНЕЦ КАК ВидНалогооблагаемойБазы,
	|	ВЫБОР
	|		КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
	|				И РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1530)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1531)
	|	КОНЕЦ КАК ВидДохода,
	|	ВЫБОР
	|		КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
	|				И РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код201)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код202)
	|	КОНЕЦ КАК ВидВычета,
	|	ВЫБОР
	|		КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
	|				И РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код618)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
	|	КОНЕЦ КАК ВидИнвестиционногоВычета
	|ПОМЕСТИТЬ _ПараметрыНОБ
	|ИЗ
	|	_СчетаДУ КАК _СчетаДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериодаГраница, ) КАК РеквизитыПИФСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
	|			ПО РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд = ПаевыеИнвестиционныеФонды.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|					&КонецПериодаГраница,
	|					Организация = &Организация
	|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
	|			ПО РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
	|		ПО _СчетаДУ.Клиент = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БазаНачисленияНДФЛОбороты.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(БазаНачисленияНДФЛОбороты.ВидДоходаВычета) = ТИП(Справочник.ВидыДоходовНДФЛ)
	|				ТОГДА БазаНачисленияНДФЛОбороты.СуммаНДФЛОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(БазаНачисленияНДФЛОбороты.ВидДоходаВычета) = ТИП(Справочник.ВидыВычетовНДФЛ)
	|					И БазаНачисленияНДФЛОбороты.ВидДоходаВычета <> ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код618)
	|				ТОГДА -БазаНачисленияНДФЛОбороты.СуммаНДФЛОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВычета,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(БазаНачисленияНДФЛОбороты.ВидДоходаВычета) = ТИП(Справочник.ВидыВычетовНДФЛ)
	|					И БазаНачисленияНДФЛОбороты.ВидДоходаВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.Код618)
	|				ТОГДА -БазаНачисленияНДФЛОбороты.СуммаНДФЛОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаИнвестВычета
	|ПОМЕСТИТЬ _НДФЛ
	|ИЗ
	|	РегистрНакопления.БазаНачисленияНДФЛ.Обороты(
	|			НАЧАЛОПЕРИОДА(&НачалоПериода, ГОД),
	|			&НачалоПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И НЕ ВидНалогооблагаемойБазы В (ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.ПоДивидендам), ЗНАЧЕНИЕ(Перечисление.ВидыНалогооблагаемыхБаз.НеучитываемыеДоходы))) КАК БазаНачисленияНДФЛОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаНачисленияНДФЛОбороты.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
	|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ _ПогашенияПаев
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПередПайщиками)
	|				И Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)) КАК ЗадолженностиПоДенежнымСредствамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПогашенияПаев.Основание КАК Основание,
	|	_ПогашенияПаев.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ПогашенияПаев.Контрагент КАК Пайщик,
	|	СУММА(ЕСТЬNULL(ПогашениеПаевПартии.СуммаПогашения, 0)) КАК СуммаДохода,
	|	СУММА(ЕСТЬNULL(ПогашениеПаевПартии.СтоимостьПокупки, 0)) КАК СуммаВычета,
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ПогашениеПаевПартии.ЗачислениеПаев КАК Документ.ЗачислениеПаев).Дата, &КонецПериода, ГОД), 0) КАК СрокВладения
	|ПОМЕСТИТЬ _ПартииДляРасчетаВычета
	|ИЗ
	|	_ПогашенияПаев КАК _ПогашенияПаев
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев.Партии КАК ПогашениеПаевПартии
	|		ПО _ПогашенияПаев.Основание = ПогашениеПаевПартии.Ссылка.Заявка
	|ГДЕ
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ПогашениеПаевПартии.ЗачислениеПаев КАК Документ.ЗачислениеПаев).Дата, &КонецПериода, ГОД), 0) >= 3
	|
	|СГРУППИРОВАТЬ ПО
	|	_ПогашенияПаев.Основание,
	|	_ПогашенияПаев.СчетДоверительногоУправления,
	|	_ПогашенияПаев.Контрагент,
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ПогашениеПаевПартии.ЗачислениеПаев КАК Документ.ЗачислениеПаев).Дата, &КонецПериода, ГОД), 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_ПартииДляРасчетаВычета.Основание КАК Основание,
	|	_ПартииДляРасчетаВычета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ПартииДляРасчетаВычета.Пайщик КАК Пайщик,
	|	СУММА((_ПартииДляРасчетаВычета.СуммаДохода - _ПартииДляРасчетаВычета.СуммаВычета) * _ПартииДляРасчетаВычета.СрокВладения) КАК Числитель,
	|	СУММА(_ПартииДляРасчетаВычета.СуммаДохода - _ПартииДляРасчетаВычета.СуммаВычета) КАК Знаменатель
	|ПОМЕСТИТЬ _ИнвестВычетПредварительно
	|ИЗ
	|	_ПартииДляРасчетаВычета КАК _ПартииДляРасчетаВычета
	|
	|СГРУППИРОВАТЬ ПО
	|	_ПартииДляРасчетаВычета.Основание,
	|	_ПартииДляРасчетаВычета.СчетДоверительногоУправления,
	|	_ПартииДляРасчетаВычета.Пайщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_ИнвестВычетПредварительно.Основание КАК Основание,
	|	_ИнвестВычетПредварительно.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ИнвестВычетПредварительно.Пайщик КАК Пайщик,
	|	ВЫБОР
	|		КОГДА _ИнвестВычетПредварительно.Знаменатель > 0
	|			ТОГДА _ИнвестВычетПредварительно.Числитель / _ИнвестВычетПредварительно.Знаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентВладенияЦБ,
	|	ВЫБОР
	|		КОГДА _ИнвестВычетПредварительно.Знаменатель > 0
	|			ТОГДА _ИнвестВычетПредварительно.Числитель / _ИнвестВычетПредварительно.Знаменатель * &ОграничениеСуммыИнвестВычета
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МаксимальныйВычет
	|ПОМЕСТИТЬ _ИнвестВычет
	|ИЗ
	|	_ИнвестВычетПредварительно КАК _ИнвестВычетПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПогашенияПаев.Основание КАК Основание,
	|	_ПогашенияПаев.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ПогашенияПаев.Контрагент КАК Пайщик,
	|	СУММА(ЕСТЬNULL(ПогашениеПаевПартии.СуммаПогашения, 0)) КАК СуммаДохода,
	|	СУММА(ЕСТЬNULL(ПогашениеПаевПартии.СтоимостьПокупки, 0)) КАК СуммаВычета
	|ПОМЕСТИТЬ _ДанныеДляЗаполнения
	|ИЗ
	|	_ПогашенияПаев КАК _ПогашенияПаев
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев.Партии КАК ПогашениеПаевПартии
	|		ПО _ПогашенияПаев.Основание = ПогашениеПаевПартии.Ссылка.Заявка
	|
	|СГРУППИРОВАТЬ ПО
	|	_ПогашенияПаев.Основание,
	|	_ПогашенияПаев.СчетДоверительногоУправления,
	|	_ПогашенияПаев.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадолженностиПоДенежнымСредствамОстатки.Основание,
	|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления,
	|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент,
	|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток * КурсыВалют.Курс / КурсыВалют.Кратность,
	|	0
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасчетыСПайщикамиПоВыплатеДоходаПоИнвестиционнымПаям)
	|				И Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)) КАК ЗадолженностиПоДенежнымСредствамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) = КурсыВалют.Период)
	|			И ЗадолженностиПоДенежнымСредствамОстатки.Валюта = КурсыВалют.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДанныеДляЗаполнения.Пайщик КАК Пайщик,
	|	_ДанныеДляЗаполнения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ПараметрыНОБ.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	_ДанныеДляЗаполнения.Основание КАК Основание,
	|	_ДанныеДляЗаполнения.СуммаДохода КАК СуммаДохода,
	|	_ДанныеДляЗаполнения.СуммаВычета КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА _ИнвестВычет.МаксимальныйВычет - ЕСТЬNULL(_НДФЛ.СуммаИнвестВычета, 0) >= _ДанныеДляЗаполнения.СуммаДохода - _ДанныеДляЗаполнения.СуммаВычета
	|			ТОГДА _ДанныеДляЗаполнения.СуммаДохода - _ДанныеДляЗаполнения.СуммаВычета
	|		ИНАЧЕ _ДанныеДляЗаполнения.СуммаДохода - _ДанныеДляЗаполнения.СуммаВычета - _ИнвестВычет.МаксимальныйВычет - ЕСТЬNULL(_НДФЛ.СуммаИнвестВычета, 0)
	|	КОНЕЦ КАК СуммаИнвестВычета,
	|	ЕСТЬNULL(_НДФЛ.СуммаДохода, 0) КАК ДоходСНачалаГода,
	|	ЕСТЬNULL(_НДФЛ.СуммаВычета, 0) КАК ВычетСНачалаГода,
	|	ЕСТЬNULL(_НДФЛ.СуммаИнвестВычета, 0) КАК ИнвестВычетСНачалаГода,
	|	_ПараметрыНОБ.ВидНалогооблагаемойБазы КАК ВидНалогооблагаемойБазы,
	|	_ПараметрыНОБ.ВидДохода КАК ВидДохода,
	|	_ПараметрыНОБ.ВидВычета КАК ВидВычета,
	|	_ПараметрыНОБ.ВидИнвестиционногоВычета КАК ВидИнвестиционногоВычета,
	|	_ИнвестВычет.КоэффициентВладенияЦБ КАК КоэффициентВладенияЦБ,
	|	_ИнвестВычет.МаксимальныйВычет КАК МаксимальныйВычет
	|ИЗ
	|	_ДанныеДляЗаполнения КАК _ДанныеДляЗаполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ _НДФЛ КАК _НДФЛ
	|		ПО _ДанныеДляЗаполнения.Пайщик = _НДФЛ.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПараметрыНОБ КАК _ПараметрыНОБ
	|		ПО (_ПараметрыНОБ.СчетДоверительногоУправления = _ДанныеДляЗаполнения.СчетДоверительногоУправления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ИнвестВычет КАК _ИнвестВычет
	|		ПО _ДанныеДляЗаполнения.Пайщик = _ИнвестВычет.Пайщик
	|			И _ДанныеДляЗаполнения.СчетДоверительногоУправления = _ИнвестВычет.СчетДоверительногоУправления
	|			И _ДанныеДляЗаполнения.Основание = _ИнвестВычет.Основание";
	

	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	ЭтотОбъект.НалоговаяБаза.Очистить();
	
	// документ заполняется сразу по нескольким ПИФАм 
	// если пайщик получил доход в этот день в разных ПИФах, то необходимо обеспечить корректный расчет налога. 
	// доход и вычет, полученные по ПИФ-1, нужно включить в доход и вычет на начало года по ПИФ-2
	// и т.д.   
	
	ТаблицаПолученногоДохода = Новый ТаблицаЗначений;
	ТаблицаПолученногоДохода.Колонки.Добавить("Пайщик");
	ТаблицаПолученногоДохода.Колонки.Добавить("СуммаДохода");
	ТаблицаПолученногоДохода.Колонки.Добавить("СуммаВычета"); 
	
	Пока Выборка.Следующий() Цикл 
		
		НоваяСтрока = ЭтотОбъект.НалоговаяБаза.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);   
		НоваяСтрока.СтавкаНДФЛ = Перечисления.СтавкиНДФЛ.Ставка13;
		НоваяСтрока.СтавкаНДФЛПовышенная = Перечисления.СтавкиНДФЛ.Ставка15;  
		
		СтрокаТЗПолученногоДохода = ТаблицаПолученногоДохода.Найти(Выборка.Пайщик, "Пайщик"); 
		Если СтрокаТЗПолученногоДохода = Неопределено Тогда
			 // нет пайщика. Добавим
			 СтрокаТЗПолученногоДохода = ТаблицаПолученногоДохода.Добавить();
			 СтрокаТЗПолученногоДохода.Пайщик = Выборка.Пайщик;
			 СтрокаТЗПолученногоДохода.СуммаДохода = Выборка.СуммаДохода;
			 СтрокаТЗПолученногоДохода.СуммаВычета = Выборка.СуммаВычета;
		 Иначе
			 // сначала добавим имеющиеся суммы к данным с начала года

			 НоваяСтрока.ДоходСНачалаГода = НоваяСтрока.ДоходСНачалаГода + СтрокаТЗПолученногоДохода.СуммаДохода;
			 НоваяСтрока.ВычетСНачалаГода = НоваяСтрока.ВычетСНачалаГода + СтрокаТЗПолученногоДохода.СуммаВычета; 
			 // все хорошо. Вот только инвест вычет остался не учтен. 
			 // я пока не умею его считать.  
			 // инвествычет принимаем по завлению. На форме при установке флага "Инвест вычет по завлению" надо пересчитать инветвычеты в ТЧ. 
			 
			 // теперь добавим данные в нарастающие итоги
			 СтрокаТЗПолученногоДохода.СуммаДохода = СтрокаТЗПолученногоДохода.СуммаДохода + Выборка.СуммаДохода;
			 СтрокаТЗПолученногоДохода.СуммаВычета = СтрокаТЗПолученногоДохода.СуммаВычета + Выборка.СуммаВычета;
			 
		КонецЕсли;
		
	КонецЦикла;     
	
	РасчетСуммыНалога();
	
КонецПроцедуры

Процедура РасчетСуммыНалога(НомерСтроки = Неопределено) Экспорт
	
	ПороговаяСумма = РаботаСНалогамиКлиентСервер.ПорогПримененияСтавкиНДФЛ15Процентов(ЭтотОбъект.Дата, Перечисления.СтавкиНДФЛ.Ставка13);    
	
	Если НомерСтроки <> Неопределено Тогда 
		ТекущаяСтрока = ЭтотОбъект.НалоговаяБаза.Найти(НомерСтроки, "НомерСтроки"); 
		РасчетСуммыНалогаПоСтроке(ТекущаяСтрока, ПороговаяСумма);
	Иначе		
		Для Каждого СтрокаНалоговойБазы Из ЭтотОбъект.НалоговаяБаза Цикл  
			РасчетСуммыНалогаПоСтроке(СтрокаНалоговойБазы, ПороговаяСумма);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти
